// src/features/region-selector/model/regions.ts
export const regionsList = [
  // Республики (24)
  "Республика Адыгея", "Республика Алтай", "Республика Башкортостан", "Республика Бурятия",
  "Республика Дагестан", "Республика Ингушетия", "Кабардино-Балкарская Республика",
  "Республика Калмыкия", "Карачаево-Черкесская Республика", "Республика Карелия",
  "Республика Коми", "Республика Крым", "Донецкая Народная Республика",
  "Луганская Народная Республика", "Республика Марий Эл", "Республика Мордовия",
  "Республика Саха (Якутия)", "Республика Северная Осетия — Алания", "Республика Татарстан",
  "Республика Тыва", "Удмуртская Республика", "Республика Хакасия", "Чеченская Республика",
  "Чувашская Республика",
  // Края (9)
  "Алтайский край", "Забайкальский край", "Камчатский край", "Краснодарский край",
  "Красноярский край", "Пермский край", "Приморский край", "Ставропольский край",
  "Хабаровский край",
  // Области (49)
  "Амурская область", "Архангельская область", "Астраханская область", "Белгородская область",
  "Брянская область", "Владимирская область", "Волгоградская область", "Вологодская область",
  "Воронежская область", "Ивановская область", "Иркутская область", "Калининградская область",
  "Калужская область", "Кемеровская область — Кузбасс", "Кировская область", "Костромская область",
  "Курганская область", "Курская область", "Ленинградская область", "Липецкая область",
  "Магаданская область", "Московская область", "Мурманская область", "Нижегородская область",
  "Новгородская область", "Новосибирская область", "Омская область", "Оренбургская область",
  "Орловская область", "Пензенская область", "Псковская область", "Ростовская область",
  "Рязанская область", "Самарская область", "Саратовская область", "Сахалинская область",
  "Свердловская область", "Смоленская область", "Тамбовская область", "Тверская область",
  "Томская область", "Тульская область", "Тюменская область", "Ульяновская область",
  "Челябинская область", "Херсонская область", "Запорожская область", "Ярославская область",
  // Города федерального значения (3)
  "Москва", "Санкт-Петербург", "Севастополь",
  // Автономная область (1)
  "Еврейская автономная область",
  // Автономные округа (4)
  "Ненецкий автономный округ", "Ханты-Мансийский автономный округ — Югра",
  "Чукотский автономный округ", "Ямало-Ненецкий автономный округ"
] as const;

export type RegionName = typeof regionsList[number];